Revit 2024 API
CurveByPointsArrayIterator Class
An iterator to a CurveByPoints array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class CurveByPointsArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class CurveByPointsArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class CurveByPointsArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurveByPointsArrayIterator
See Also
CurveByPointsArrayIterator Members
Autodesk.Revit.DB Namespace